app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers`
---
  def index
    @customers = Customer.all

INSERT INTO `customers` (`Fname`, `Sname`, `Email`, `password`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('yousef', 'okka', 'yousefokka2231@gmail.com', 'yousefokka', '01159184612', 'egyot-cairo-qaluop', '2018-12-18 23:00:53', '2018-12-18 23:00:53')
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

DELETE FROM `customers` WHERE `customers`.`id` = 3
---
  def destroy
    @customer.destroy

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
    def set_customer
      @customer = Customer.find(params[:id])