app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT `departments`.* FROM `departments`

  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO `departments` (`name`, `location`, `special`, `created_at`, `updated_at`) VALUES ('it ', 'cairo', 'it work ', '2018-12-18 16:57:05', '2018-12-18 16:57:05')

    def set_department
      @department = Department.find(params[:id])
---
SELECT  `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1