app/controllers/ecomercs_controller.rb

SELECT `ecomercs`.* FROM `ecomercs`
---
  def index
    @ecomercs = Ecomerc.all