app/controllers/employees_controller.rb

INSERT INTO `employees` (`FName`, `LName`, `Email`, `password`, `age`, `address`, `phone`, `department_id`, `created_at`, `updated_at`) VALUES ('yousef', 'okka', 'yousefokka2231@gmail.com', 'yousefokka', 20, 'qaluop', '01159184612', 1, '2018-12-18 17:34:45', '2018-12-18 17:34:45')
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])